Revit 2025 API
AirHeatingCoilType Enumeration
 The type of air heating coil.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum AirHeatingCoilType
Public Enumeration AirHeatingCoilType
public enum class AirHeatingCoilType
type AirHeatingCoilType
Members
Member name | Value | Description
None | 0
ElectricResistance | 1
Furnace | 2
HotWater | 3
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace